---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures.AlignmentCheckStationLabels
source: html/8b6b2e80-a817-5c50-30dd-d58feb07bef5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AlignmentFailures.AlignmentCheckStationLabels Property

A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels.
 Please check the labels to ensure proper placement.

## Syntax (C#)
```csharp
public static FailureDefinitionId AlignmentCheckStationLabels { get; }
```